1. // JavaScript არის მაღალი დონის პროგრამირების ენა, რომელიც ძირითადად გამოიყენება ვებ-გვერდებზე ინტერაქტივობის დასამატებლად.
// მაგალითად: ღილაკებზე რეაგირება, მონაცემების შემოწმება, სლაიდერები, მოდალური ფანჯრები და სხვა დინამიკური მოქმედებები.

// თავდაპირველად JavaScript შეიქმნა 1995 წელს კომპანია Netscape-ში,
// მაგრამ დღეს ის გამოიყენება როგორც ფრონტენდში, ასევე სერვერულ მხარეს (Node.js-ის მეშვეობით).



2. // კონსოლი (console) არის დეველოპერის ინსტრუმენტების ნაწილი ბრაუზერში, სადაც ჩვენ შეგვიძლია ვნახოთ სხვადასხვა შეტყობინება ან შეცდომები კოდის შესრულებისას.

// ყველაზე ხშირად გამოიყენება console.log() ფუნქცია ინფორმაციის გამოსატანად:
// ეს ეხმარება დეველოპერებს პრობლემების დიაგნოსტიკაში (debugging).

3. // მოვლენა არის ნებისმიერი ქმედება, რომელიც ხდება მომხმარებლის ან სისტემის მხრიდან (მაგ: click, scroll, input, resize და სხვები).
// მოვლენის მსმენელი (Event Listener) არის ფუნქცია, რომელიც უსმენს ამ ქმედებას და რეაგირებს მასზე.

4. //<button id="nameButton">Click Me</button>

//document.getElementById("nameButton").addEventListener("click", function () {
// //console.log("თქვენი სახელი: ნიკოლოზი");
//});

5. //<img id="myImage" src="photo1.jpg" width="300" alt="My Image" style="cursor:pointer;">
//document.getElementById('myImage').addEventListener('click', function () {
  const img = this;

  // ვამოწმებთ რომელ სურათზე ვართ და ვცვლით
 // if (img.src.includes("photo1.jpg")) {
    //img.src = "photo2.jpg";  // შეცვლა მეორე ფოტოზე
   // img.width = 500;         // ზომის გაზრდა
 // } else {
    //img.src = "photo1.jpg";  // დაბრუნება პირველ ფოტოზე
    //img.width = 300;         // ზომის დაბრუნება
 // }
//});
